##### Importando as bibliotecas

In [1]:
import pandas as pd

##### Criando o Dataframe

In [2]:
CaminhoArquivo = r'C:\Python\ETL\ArquivosExcel\Produto.xlsx'
df = pd.read_excel(CaminhoArquivo)
df.head()

   ID                  Name  Price  Id_Category
0   0       Sapato vermelho     96            0
1   1  Bolsa mais que Velha   8000            0
2   2                 Calça     75            0
3   3    Camisa apertadinha    170            0
4   4   Vestido Super curto     57            0

##### Listar itens distintos de uma coluna

In [3]:
Coluna = 'Name'

dfDistintos = df[Coluna].unique()
dfDistintos

array(['Sapato vermelho', 'Bolsa mais que Velha', 'Calça',
       'Camisa apertadinha', 'Vestido Super curto', 'Perfume',
       'Creme de Barbear', 'Hidratante caro', 'Shampoo', 'Protetor Solar',
       'Geladeira', 'Fogão', 'TV', 'Máquina de Lavar', 'Máquina de Secar',
       'O Romance Exagerado', 'Suspense Demais', 'Terror Aterrorizante',
       'A Comédia Engraçada', 'A História de SQL', 'Ai-Fone',
       'Galáxia R10', 'Chiai-homi', 'Ruaei', 'Nóquia', 'Mouse', 'Teclado',
       'Pen-Drive', 'Impressora', 'HD Externo', 'Poltrona', 'Almofada',
       'Cadeira', 'Sofá', 'Mesa', 'Video-Game', 'Máquina Fotográfica',
       'Notebook', 'PC', 'Secador de Cabelo', 'Chuteira', 'Tornozeleira',
       'Raquete', 'Bola', 'Pebolim', 'Futebol 2020', 'Iôiô', 'Peão',
       'Bey-Blade', 'Casinha de Boneca'], dtype=object)

##### Operacoes de Pesquisa

In [4]:
Item = 'Calça'
dfItem = (df.loc[df['Name'] == Item])
dfItem

   ID   Name  Price  Id_Category
2   2  Calça     75            0

In [5]:
Itens = ['Fogão', 'Calça', 'Mesa', 'TV']

dfItens = (df.loc[df['Name'].isin(Itens)])
dfItens

    ID   Name  Price  Id_Category
2    2  Calça     75            0
11  11  Fogão   1373            2
12  12     TV   1992            2
34  34   Mesa    143            6

In [6]:
dfM1000 = df.loc[df['Price'] > 1000].sort_values('Price')
dfM1000

    ID                  Name  Price  Id_Category
22  22            Chiai-homi   1152            4
11  11                 Fogão   1373            2
20  20               Ai-Fone   1720            4
14  14      Máquina de Secar   1774            2
13  13      Máquina de Lavar   1826            2
10  10             Geladeira   1952            2
12  12                    TV   1992            2
21  21           Galáxia R10   2007            4
24  24                Nóquia   2663            4
23  23                 Ruaei   2795            4
1    1  Bolsa mais que Velha   8000            0

In [7]:
dfEntre200e1000 = df.loc[(df['Price'] >= 200) & (df['Price'] <= 1000)].sort_values('Price')
dfEntre200e1000

    ID                 Name  Price  Id_Category
36  36  Máquina Fotográfica    377            7
38  38                   PC    385            7
37  37             Notebook    493            7
39  39    Secador de Cabelo    580            7
35  35           Video-Game    602            7
7    7      Hidratante caro    800            1